#include<iostream>
#include<string>
#include<cstring>
#include<cstdlib>
#include<cstdio>
#include<Windows.h>
using namespace std;

struct node {
	string content;//设定内容
	string setName;//设定名称
}set[15];

void start();//开始游戏，介绍游戏背景
void choose();//选择操作
void plot();//剧情
void setting();//选择设定解说
void exitt();//退出游戏
void play(int,int);//播放设定解说
void setInitial();//设定初始化
void plot1();//剧情1
void plot2();//剧情2
void plot3();//剧情3
void plot4();//剧情4
void plot5();//剧情5
int num();//选择函数，返回按下的数字
int setspeed();//设置剧情播放速度
void about();//关于

int main()
{
	setInitial();
	start();
	choose();
	//system("pause");
	return 0;
}

void start() {
	
	string txt;
	txt = "人类灭亡了——500年前，被人类制造出的“17兽”的怪物失控反而被兽消灭，其它种族后来逃离大地，生活在浮空岛上。";
	for (int i = 0; i < txt.size(); i++) {
		cout << txt[i];
		Sleep(50);
	}
	cout << endl;
	cout << endl;
	Sleep(500);
	string txt1;
	txt1 = "如今的世界是兽人为主，没有獠牙和长角的种族则被称为无征种，遭到歧视。在这种悲惨的大环境之下，男主的新工作是管理特殊兵器——一群黄金妖精！";
	for (int i = 0; i < txt1.size(); i++) {
		cout << txt1[i];
		Sleep(50);
	}
	cout << endl;
	cout << endl;
	Sleep(500);
	string txt2 = "真身为“妖精”的少女们，就像当年的人类勇者一样，背负着拯救他人的宿命，一次又一次地踏上战场，直至最后燃尽生命......";
	for (int i = 0; i < txt2.size(); i++) {
		cout << txt2[i];
		Sleep(50);
	}
	cout << endl;
	cout << "==========================================================================================================" << endl;
	Sleep(1000);
	txt = "你好，欢迎来到这行将终末，没有救赎的世界。这是一个关于珂朵莉与威廉的故事。";
	for (int i = 0; i < txt.size(); i++) {
		cout << txt[i];
		Sleep(50);
	}
	cout << endl;
	cout << "==========================================================================================================" << endl;
	Sleep(1000);
}

void choose() {
	cout << "请选择接下来要做的事：" << endl;
	cout << "1.选择剧情  2.查看设定解说  3.退出  4.关于" << endl;
	int x;
input: x = num();
	switch (x)
	{
	case 1:plot(); break;
	case 2:setting(); break;
	case 3:exitt(); break;
	case 4:about(); break;
	default:
		cout << "请重新输入1至4之间的整数：" << endl;
		goto input;
		break;
	}
	cout << endl << endl;
}

void setting() {
	cout << "请选择想要查看的设定：" << endl;
	cout << "1.黄金妖精  2.魔力  3.妖精乡之门  4.悬浮大陆群  5.遗迹兵器  6.护符  7.魔力中毒  8.前世侵蚀  9.十七兽  10.勇者  11.返回" << endl;

	int x;
	inputxx: x = num();
	bool judge = 1;//判断输入的数是否是1至10之间的整数
	for (int i = 1; i <= 11; i++) {
		if (x == i)
		{
			judge = 0;
			break;
		}
	}
	if (judge) {
		cout << "请重新输入1至11之间的整数:" << endl;
		goto inputxx;
	}
	cout << "==========================================================================================================" << endl;
	if (x == 11)
		choose();
	else
	play(x, 0);
}

void exitt() {
	cout << "确定要退出吗？（退出后进度不会被保存）" << endl;
	cout << "请确认：[Y/N]" << endl;
	char c;
	cin >> c;
	while (c != 'Y' && c != 'y' && c != 'N' && c != 'n') {
		cout << "输入非法，请重新输入：" << endl;
		cin >> c;
	}
	if (c == 'Y' || c == 'y') {
		exit(0);
	}
	else if (c == 'N' || c == 'n') {
		choose();
	}
}

void play(int x, int t) {

	int maxn = set[x].setName.size();
	for (int i = 0; i < maxn; i++) {
		cout << set[x].setName[i];
		Sleep(t);
	}
	maxn = set[x].content.size();
	for (int i = 0; i < maxn; i++) {
		cout << set[x].content[i];
		Sleep(t);
	}
	cout << endl;
	cout << "==========================================================================================================" << endl;
	choose();
}

void setInitial() {
	set[1].setName = "黄金妖精：";
	set[1].content = "是还没有来得及理解死亡是什么概念的孩子的灵魂在迷失时所诞生出来的东西。严格来说并不是一个拥有正常生命的存在。作为代替人来使用遗迹兵器对兽作战的工具。实质为死灵的一种。";
	
	set[2].setName = "魔力：";
	set[2].content = "魔力是与生命力成反比的存在，生命力越弱魔力越大，反之亦然。因此对生存没有渴望的黄金妖精具有庞大的魔力量。";
	
	set[3].setName = "妖精乡之门：";
	set[3].content = "通过自身的魔力操作，使魔力暴走引发大规模的爆炸和燃烧效应。是妖精兵对付<兽>的最后手段。";
	
	set[4].setName = "悬浮大陆群：";
	set[4].content = "地面被“十七兽”毁灭之后，残存生物们在天空建立起来的残存文明。已历时五百余年，虽然还会不时受到第六兽分裂之后飘来的袭击。但还是十分安全的居所。浮游岛的编号越小即为越靠近中心的岛。";
	
	set[5].setName = "遗迹兵器：";
	set[5].content = "亦称圣剑。是收集了各种各样的护符，再用咒力线“绑定”成刀剑外形，经过千奇百怪的相互干涉作用以后就会发挥出截然不同的功效。现今能对<兽>造成伤害和击杀的存在。";
	
	set[6].setName = "护符：";
	set[6].content = "来自古代的秘宝兼秘术。如今已失去其详细的制法。将强大的咒术效果或天赋异禀，刻入小小的纸片，陶片或金属片。将其带在身边就能获得其中的咒术恩惠。";
	
	set[7].setName = "魔力中毒：";
	set[7].content = "长时间燃烧魔力或短时间燃烧大量的魔力，会导致魔力团块集聚在肌肉中，造成身体的疲劳。若经常没有得到有效处理，严重时会危及性命。";
	
	set[8].setName = "前世侵蚀：";
	set[8].content = "因为黄金妖精是被死灵术所创造的个体。若回忆起前世的记忆，会导致现有个体身体机能和人格的崩坏。该现象多发在二十岁以上的成体妖精中。";
	
	set[9].setName = "十七兽：";
	set[9].content = "500年前突然在人类国家帝国的首都附近出现，肆虐大地，杀害生命，毁灭一切。不到一年的时间，灭亡了人族，古灵族（Elf），豚头族（Orks），龙族（Dragon）等等。其真正面目为因体内兽的灵魂碎片觉醒而失去人类外形的人类。没有飞行能力（除第六兽可以释放飞行孢子以外），因此浮游大陆群是相对安全的存在。";
	
	set[10].setName = "勇者：";
	set[10].content = "在大地被毁灭前人类帝国选出的对抗外敌的最强者，本身实力过人，但大部分时间却被赞光教会拿来当宣传，但因其宣传过于虚假，导致普通人民不会知道前线到底在于什么怪物战斗。";
}

void plot() {
	cout << "请选择剧情(为了不影响游戏体验，强烈建议按顺序选择剧情)：" << endl;
	cout << "1.《在太阳西斜的这个世界里》" << endl;
	cout << "2.《在那场仗开始以前》" << endl;
	cout << "3.《纵使日薄西山》" << endl;
	cout << "4.《此时此刻的光辉》" << endl;
	cout << "5.《世界上最幸福的少女》" << endl;
	cout << "6.返回" << endl;

	string xx;//先定义成字符串类型的，再转换成整数类型，防止玩家输入除数字以外字符无法处理
	inputxx: cin >> xx;
	int x = 0;
	for (int i = 0; i < xx.size(); i++) {
		if (xx[i] < '0' || xx[i]>'9') {
			cout << "输入非法，请重新输入：" << endl;
			goto inputxx;
		}
		else
			x = x * 10 + xx[i] - '0';
	}
	cout << "==========================================================================================================" << endl;
	switch (x)
	{
	case 1:plot1(); break;
	case 2:plot2(); break;
	case 3:plot3(); break;
	case 4:plot4(); break;
	case 5:plot5(); break;
	case 6:choose(); break;
	default:
		cout << "输入非法，请重新输入：" << endl;
		goto inputxx;
		break;
	}
}

int num() {
	string xx;//先定义成字符串类型的，再转换成整数类型，防止玩家输入除数字以外字符无法处理
	inputxx: cin >> xx;
	int x = 0;
	for (int i = 0; i < xx.size(); i++) {
		if (xx[i] < '0' || xx[i]>'9') {
			cout << "输入非法，请重新输入：" << endl;
			goto inputxx;
		}
		else
			x = x * 10 + xx[i] - '0';
	}
	return x;
}

int setspeed() {
	int t = 0;
	string speed;//先定义成字符串类型的，再转换成整数类型，防止玩家输入除数字以外字符无法处理
	cout << "请输入播放速度（即输出两句话的间隔时间，输入1000表示1秒，不得超过9999，建议1500左右，也可输入0整体阅读）：" << endl;
	inputv: cin >> speed;
	for (int i = 0; i < speed.size(); i++) {
		if (speed[i] < '0' || speed[i]>'9' || speed.size() > 4) {
			cout << "输入非法，请重新输入：" << endl;
			goto inputv;
		}
		else
			t = t * 10 + speed[i] - '0';
	}
	return t;
}

void plot1() {
	int t = setspeed();
	string s[50] = {
	" ",
	"黑猫正在奔跑着。",
	"它跑得可漂亮了。",
	"钻过窄巷,从围墙上跑过。",
	"跃过摊贩上头的帆布。",
	"「给！我！站！住──！」",
	"身为追兵的少女拉大嗓门。",
	"她挤进窄巷,经过围墙上。",
	"她用蓝眼睛直望前方，一个劲儿地追赶着黑猫的尾巴。",
	"",
	"少女打扮朴素。大大的灰色帽子戴得低低的，身上穿着同样顔色的大衣。那样穿搭恐怕是为了尽量低调，",
	"「我！叫你！站住了！吧！」",
	"少女疾奔的步伐扬起沙尘，踹翻空油漆罐，让大衣下摆随之翻飞。",
	"这时候，黑猫忽然停了下来。",
	"「逮到你啦！」",
	"少女抓准机会纵身一跃。",
	"黑猫似乎是感受到少女逼近的动静而回头。它叼在嘴边的某种东西正散发银光。",
	"少女张开双臂，整个人扑上去将黑猫逮住。",
	"",
	"不自然的漂浮感将她全身包裹。",
	"脚下什么也没有。",
	"「……咦？」",
	"「奇怪？」",
	"看得见蓝天,也看得见白云。",
	"少女搂着黑猫跃向没东西可抓的半空中。",
	"能看见正下方的西侧第七白铁摊贩街，主要贩卖锅子、菜刀的摊贩林立于窄巷中。",
	"若将自己与窄巷之间的距离换算成建筑物的高度，差不多有四层楼高。",
	"",
	"「不会吧……！」",
	"少女绷紧身体。",
	"连惨叫的时间都没有。原本感觉还远在下方的石版道，不知不觉已经占满整个视野。少女的双手不禁用力。黑猫放声尖叫。她闭紧双眼。",
	"仓皇之间，地面仍迅速逼近──"
	};
	for (int i = 0; i <= 31; i++) {
		cout << s[i] << endl;
		Sleep(t);
	}
	cout << endl << endl << endl;

	cout << "此时，如果你在场会怎么做：" << endl;
	cout << "1.跑过去接住她  2.假装没看见  3.赶紧买根冰棍压压惊" << endl;
	bool judge = 1;
	int x;
	input: x = num();
	switch (x)
	{
	case 1:judge = 0; cout << "好（路人给你竖起了大拇指）" << endl; break;
	case 2:cout << "见死不救，原地枪毙" << endl; break;
	case 3:cout << "卖冰棍的给了你一巴掌并让你滚" << endl; break;
	default:
		break;
	}
	if (judge) {
		cout << "请重新选择：" << endl;
		goto input;
	}
	cout << endl;
	Sleep(2000);
	string s1[30] = {
	"威廉冲向少女坠落的地点，并伸出双手想将她接住。然而，对方以出乎意料的惊人之势摔下，凭他瘦弱的双臂根本接不住少女的身子。",
	"这么一来，结果自然再明白不过。",
	"「咕呃啊！」",
	"下一瞬间，他就成了少女的肉垫，还叫得活像被压扁的青蛙。",
	"「……好痛……」",
	"他以从腹部硬挤出来的声音呻吟。",
	"",
	"「对……对不起！」",
	"又隔了几秒才似乎掌握情况的少女连忙退开。",
	"「有……有没有受伤？你还活着吗？内脏有没有被压扁……啊！」",
	"有只黑猫从慌张的少女怀里逃走。她下意识伸出的手扑了空。惊慌失措之间，猫咪的背影就消失在人群中看不见了。",
	"「呀……啊啊啊！」",
	"接着，少女察觉了自己的模样。",
	"",
	"不知道是在全力奔跑途中，还是在变成自由落体时，她那戴得低低的帽子不知不觉间就不见了。",
	"剔透的蓝色发丝流泻到肩膀下方。",
	"──喂，你看那家伙。",
	"不知从哪里传来了这样的细语。",
	"走在西侧第七白铁摊贩街上的众多行人停下脚步，摊贩老板们打住谈到一半的生意，将目光投注于少女的头发和脸上。",
	"",
	"悬浮大陆群上，住有过去曾为星神眷属的各色种族。其样貌当然也五花八门。有的生着角；有的长着獠牙；有的覆有鳞片；有的则是相貌奇特，脸上的五官之一像是从野兽身上替换而来。",
	"尽管人数少归少，在他们之中还是存在着没有角，没有獠牙，没有鳞片，没有任何部位与野兽相似的种族。",
	"像这样不具明显种族「特徵」的种族，俗称为「无徵种」。",
	"──为什么会出现在这里？",
	"──啧，看见晦气的玩意儿了。",
	"无徵种普遍受到嫌恶。",
	"据说这是因为他们和以往毁灭广阔大地，将所有生物赶到天上的传说种族「人族」长得一模一样的缘故。外貌相似者，性质也会相似，故无徵种就被视为不祥且不净之物了。",
	"虽然公然受迫害的状况并不多，但体会到无处容身之感仍在所难免。"
	};

	for (int i = 0; i <= 27; i++) {
		cout << s1[i] << endl;
		Sleep(t);
	}
	cout << endl << endl << endl;

	cout << "此时，如果是你会怎么做：" << endl;
	cout << "1.自己迅速逃离现场  2.和少女一起离开  3.装死" << endl;
	judge = 1;
	input1: x = num();
	switch (x)
	{
	case 2:judge = 0; cout << "你是一个正常人" << endl; break;
	case 1:cout << "只顾自己，你被少女保护协会的成员按在地上打" << endl; break;
	case 3:cout << "戏精本精，你被反戏精协会的成员吊起来打" << endl; break;
	default:
		break;
	}
	if (judge) {
		cout << "请重新选择：" << endl;
		goto input1;
	}
	Sleep(2000);
	cout << endl;
	string s2[30] = {
	"「我……我知道啦……我马上离开……」",
	"视线逼得少女站起身来，打算奔离现场。但她办不到。",
	"依然四脚朝天的威廉正用手抓着少女的手腕。",
	"「咦……？」",
	"「妳忘了东西。」",
	"威廉将另一只没抓着少女手腕的手伸过去。少女战战兢兢地伸出手掌，他就将小小的胸针搁到那上面。",
	"",
	"「啊。」",
	"「刚才那只小猫掉的。妳就是在追这个吧？」",
	"少女点了两次头。",
	"「谢……谢谢你。」",
	"困惑归困惑，她还是用双手捧着收下了胸针。",
	"「你第一次来这附近？」",
	"少女又点头。",
	"「……这样啊。没办法喽。」",
	"",
	"威廉起身摘掉自己的斗篷，然后不容分说就把那盖到少女头上。",
	"没了风帽的他，本身容貌便暴露在外。",
	"缠绕皮肤的扎人视线与嘈杂声，这次转而针对他。",
	"「咦……」",
	"威廉自己看不见自己的模样。不过他当然很清楚自己是什么样子。所以他很明白周遭的人们──还有眼前披上斗篷的呆愣少女看见了什么。",
	"",
	"有着一头杂乱黑发，本应寻常无奇的成年男性。",
	"「我们走。」",
	"他牵起少女的手迈步前进。「咦，咦，咦？」摸不清状况的少女尽管拖着声声疑问，还是用小跑步匆匆跟着。",
	"两人仓促地离开了现场。"
	};
	for (int i = 0; i <= 25; i++) {
		cout << s1[i] << endl;
		Sleep(t);
	}
	cout << endl << endl << endl;
	Sleep(2000);

	string s3[50] = {
	"威廉就近找了间帽店，进去买了顶普通的帽子并把它戴到少女头上。",
	"「那……那个──...谢谢你替我做了这么多。",
	"还有，对不起，给你添了不少麻烦。",
	"呃，然后，我想我没有立场讲这种话，不过──」",
	"他搔了搔头。",
	"「妳有想去的地方，对吗？说来听听。」",
	"少女的脸孔变得神采焕发──",
	"",
	"在位于这座「悬浮岛」最高处的破烂高塔上。",
	"脚底下铺着廉价金属板，每走一步路都会发出铿铿锵锵的嘈杂声响，两人绕了又绕，终于才抵达那里。",
	"他们刚才一会儿找公家自律人偶问路；一会儿为了三岔路增加为五条岔路而头痛；",
	"一会儿掀开路旁的布帘却撞见蛙面族人在洗澡；一会儿又被迷路的狂牛追着跑；一会儿还因为东跑西闪地到处逃，",
	"而莫名其妙地摔到鸡舍上，把屋顶撞了个洞，于是只好向怒骂的球形族人道歉，同时落荒而逃。",
	"「啊哈哈哈，好惨喔！」",
	"然后，现在。",
	"「哇啊──」",
	"少女正把身子探到作用聊胜于无的护栏外，还发出情绪鲜明的感叹。",
	"",
	"放眼望去，景致确实不赖。近看只觉得乱糟糟的那片街景，换作从远处俯瞰，看起来就像描绘精细的花纹。",
	"巷道未经规划自然发展出的蜿蜒样貌，俯瞰起来倒也有了真实生物般的跃动感。",
	"视线从巷道稍微往上，就能看见港湾区。悬浮岛外缘有一部分被金属覆盖，该处备有飞空艇起降所需的设备，相当于岛屿对外的门户。",
	"从港湾再过去──当然就是整片蔚蓝的天空。",
	"在这片天空中，有着为数过百的巨大岩块随风飘浮。那些弹丸之地被称作「悬浮岛」，这些便是现今「人们」能栖息居住的整个世界。",
	"少女嘻嘻地笑了笑，然后确认过周遭没有别人的身影，才摘下帽子。",
	"蓝色发丝──色泽和天空一样的秀发被风梳开，随即流泻盈落。",
	"",
	"「妳想看的就是这片风景吗？」",
	"「是啊。虽然我从更高更远的地方看过悬浮岛，可是至今为止，我都没有好好地从城里俯望过整座城市。」",
	"「今天真的很谢谢你。发生了好多美好的事情。全都是讬你的福。」",
	"「妳说得太夸张了吧。」",
	"威廉搔了搔后脑勺。",
	"「……所以，那是来接妳的吗？」",
	"「咦？」",
	"威廉用眼神示意要少女看背后。",
	"",
	"回头的少女微微发出「啊」的一声，表情变得交杂着惊讶与愧疚。",
	"不知何时起，有个魁梧的爬虫族人就站在那里。",
	"他们属于全身覆有鳞片的种族，和其他种族相比，特徵是个体间的体格落差极为悬殊。而且他不知为何身穿着军服，该怎么说呢，他单是站在那里，就朝四周散发出无比的压迫感。",
	"「──是啊。我留下了美梦般的回忆，不过时间到了。」",
	"少女一个转身。",
	"「最后我想再拜讬你一件事就好。但愿你能忘了我。」",
	"说完，她便跑到爬虫族人身边。",
	"",
	"什么跟什么啊。他心想。",
	"少女在最后又一次低头行礼，接着就与爬虫族人一起消失在塔下层的人群中了。",
	"──从港湾区的方位远远传来了钟楼告知黄昏时分的乐音。",
	"「哎呀，已经这么晩啦。」",
	"威廉约好傍晚要跟人见面。尽管好像还有时间，但是看来没什么闲暇了。",
	"他又朝底下的街景──还有再过去的整片天空望了一眼后，同样走进了人群之中。"
	};

	for (int i = 0; i <= 48; i++) {
		cout << s3[i] << endl;
		Sleep(t);
	}
	Sleep(2000);
	cout << "（第一卷完）" << endl;
	cout << "==========================================================================================================" << endl;
	choose();
}

void plot2() {
	int t = setspeed();
	string s0[30] = {
	"在太阳西斜的这个时刻，大街上繁华热闹。装在街头巷尾的灯晶石不分日夜地点亮周遭。",
	"薄烟弥漫，各色「行人」来来往往，搅乱淡淡紫烟。绿鬼族扯开嗓门叫卖。猫徵族女娼吞云吐雾。豚头族的几个小夥子一边哄笑一边阔步于大街上。",
	"相较之下，这条暗巷就安静得多。",
	"那里没有声音，没有气味，没有动静，令人难以相信与那片喧嚷只隔着一栋建筑物。",
	"",
	"「半年左右没见了吧，葛力克。」",
	"在平价餐馆中，位于内侧的座位。青年傻呵呵地对久违的朋友露出缺乏霸气的笑容。",
	"他仍穿着破破烂烂的斗篷，不过现在已经拿下了风帽，无徵种的脸孔暴露在外。",
	"被称作葛力克的男子──他是典型的绿鬼族──只是一边数着收到的钱，一边状似不满地微微哼声。",
	"气氛微妙。",
	"",
	"钱算好了。",
	"「三万两千。我确实收到啦。」",
	"葛力克敲了敲纸钞将边缘对齐，然后重新装回信封里。",
	"「……欸，威廉。你真的觉得这样好吗？」",
	"「半年赚三万，剩余款项十五万。假如一切顺利，还要两年半。」",
	"「啊──抱歉，要赚得更快会有点困难。」",
	"「我又没有在催你。你明知道才那样讲的吧。」",
	"",
	"葛力克将信封塞进旧皮革包里，接着说：",
	"「这里是兽人族居住的岛屿，兽人族对无角无鳞无兽耳的家伙──『无徵种』都抱持反感。你身上怎么看都没有特徵，不可能接得到正当工作。我猜你都是靠工钱寒酸到不行的零工勉强过活的吧？」",
	"「哎，是没错啦……」",
	"威廉的目光往斜上方飘。",
	"葛力克眯起眼睛。",
	"",
	"「既然如此，这些就是你半年来所赚的近全额工钱了。对不对？」",
	"「有扣掉餐费喔。因为最近的工作都不肯附伙食。」",
	"「真是的，问题不在那里。」",
	"「……欸，有一项差事，你要不要接看看？」葛力克咕哝问道。",
	""
	};
	for (int i = 0; i <= 29; i++) {
		cout << s0[i] << endl;
		Sleep(t);
	}

	cout << "此时，如果是你会怎么做：" << endl;
	cout << "1.起身走人  2.假装没听到  3.继续听下去" << endl;
	bool judge = 1;
	int x;
	input: x = num();
	switch (x)
	{
	case 3:judge = 0; break;
	case 2:cout << "葛力克提高嗓门又问了你一遍" << endl; break;
	case 1:cout << "无视朋友，重情重义的老板把你扣下了" << endl; break;
	default:
		break;
	}
	if (judge) {
		cout << "请重新选择：" << endl;
		goto input;
	}
	cout << endl << endl << endl;
	Sleep(2000);

	string s1[30] = {
	"「地表调查队的飞空艇「虎耳草」遭到〈兽〉袭击而被击坠了。我被聘请为顾问到地面去参与调查，然后现在还缺几个人。」",
	"绿鬼族那彷佛将琥珀崁在眼窝的眼珠直望着威廉继续说道。",
	"「你也和我一起来吧。毕竟你是我宝贵的朋友。」",
	"",
	"「兽？击坠？」",
	"听起来不太平稳的字眼。",
	"「你也晓得吧。我已经没办法作战喽。」",
	"「我明白。也没有叫你上战场去打打杀杀啦。多的是搬运物资等体力活要你做。」",
	"「什么跟什么啊？那种差事交给打工人员做好吗？」",
	"「大概不好。哎，反正我会帮你把身分文件那些都准备好。」",
	"讲话内容还是不太稳当的葛力克咯咯大笑。",
	"",
	"「反正只是打打杂，用不着特别的技术或资格。顺带一提，将风险津贴和保密费那些全部加起来，酬劳金额还不赖。就算把你的债全还清，剩下的钱也不算少。你就用那笔钱去找个方式过活吧。",
	"我知道你有你的隐情，不过别浪费获救的性命，在这个世界好好活下去。那就是我跟那些家伙的愿──」",
	"说到这里，葛力克摇了摇头。",
	"「抱歉。因为熟人变少的关系，好像连我都变得情感脆弱了。」",
	"绿鬼族青年脸上的苦笑，已经扭曲得连其他种族的人都能清楚看出。",
	"",
	"「我懂了。麻烦你说得更详细一点。」",
	"「你愿意接？」",
	"「我要多听一会儿再决定。拜讬你，先把那些听完就拒绝不了的软话收回去。」",
	"「了解。首先我得说……」",
	"葛力克露出明显开心的脸孔，目光落到了手边的咖啡上，又说：",
	"「……这里的咖啡喝起来，还真的有股咸味。」",
	"他咧嘴一笑。",
	"葛力克是个理性，善辩而且重人情的绿鬼族人，换句话说，他是个好家伙。",
	""
	};
	for (int i = 0; i <= 26; i++) {
		cout << s1[i] << endl;
		Sleep(t);
	}
	cout << endl << endl << endl;
	Sleep(2000);

	string s2[25] = {
	"要从天上到下面去，该怎么做才好？",
	"最简单的方法应该连婴儿都知道。没错，只要就近从悬浮岛的边缘向外踏一步出去就行了。那样应该就可以名符其实地飞越超过一千卯里的距离，和大地之母来个热情的拥吻。旅费只收一条命。划算。",
	"然后，想要找除此以外的方法，难度会顿时暴增。假如再添上去了之后要回来的条件，就更加费事了。",
	"",
	"据传悬浮大陆群被大规模的结界所笼罩。如果想用一般在悬浮岛之间移动的普通飞空艇进出这道结界，听说仪器会全数失灵，变得无法正常航行。要防止失灵就必须准备成套器材，再搭配降落地表用保护措施，这道程序又需要花下大笔钱财和工夫。",
	"船体格外会晃；床舱及通道都有谜样的粗大管路突出在外；油汙味渗入四周环境；到处都有肉酱空罐丢弃在地上，诸如此类的问题说也说不完。",
	"如果单纯只有环境恶劣，事到如今也不会有什么感觉。然而，光是把飞空艇特有的摇晃加上去，不快感就轻易突破极限了。",
	"",
	"预定飞行时间为四十二小时。",
	"地狱般的四十二小时。",
	"高度零地带K96──MAL遗迹地区。",
	"地表调查用飞空艇「虎耳草」坠落地。",
	"「全世界居然都在晃……」",
	"",
	"威廉踏着蹒跚的脚步降落在灰色沙子上。",
	"鞋底只有相当于手掌的厚度，会陷进柔软的沙子中。光走路就会耗费体力，即使要跑步或作战也时时伴随着跌倒的危险。",
	"整片灰色的废墟。彷佛将灰色的混浊染料倒在即将崩塌的石砌建筑头上，有许多像那样的奇妙纪念碑排在一块。",
	"以往，这些曾是座小城镇。",
	"位在帝国领地的国境附近，离帝都有一大段距离。",
	"绝对不算大也不丰饶。还偏离所有主要的交易干道，更没有什么能打出名气的特产品。花了几百年静静累积其历史的城镇。原本应该在后来继续累积其历史的城镇。",
	""
	};
	for (int i = 0; i <= 20; i++) {
		cout << s2[i] << endl;
		Sleep(t);
	}
	cout << endl << endl << endl;
	cout << "在人群中，威廉看见一个似曾相识的身影，此时，如果是你会怎么做：" << endl;
	cout << "1.过去打个招呼  2.假装没看到  3.躲在某处偷偷观察" << endl;
	judge = 1;
	input1: x = num();
	switch (x)
	{
	case 1:judge = 0; cout << "你没有社恐真是太好了" << endl; break;
	case 2:cout << "基本的社交礼仪都不知道，把三字经抄一百遍再来玩游戏" << endl; break;
	case 3:cout << "保安人员看你行为可疑立刻把你拷走了" << endl; break;
	default:
		break;
	}
	if (judge) {
		cout << "请重新选择：" << endl;
		goto input1;
	}
	cout << endl;
	Sleep(2000);
	string s3[25] = {
	"觉得眼熟的天蓝色头发。",
	"之前曾见过的那张脸，貌似吃惊地（应该说对方就是吃了一惊）朝你看了过来。",
	"「咦？上面派来的救援队……你也在？怎么会？」",
	"「嗨……该怎么说呢，呃……好久不见？」",
	"威廉轻轻举起手，朝对方微笑。",
	"然后他重新观察对方的模样。",
	"",
	"年纪──以「人族」为基准，大约十五六岁，要不然就是接近。身上并无特徵，整体造型和人类十分类似……可是让人联想到春天晴朗天空的鲜艳蓝发，绝非人族会有的发色。无论用何种染料，感觉都不能表现出这么自然的透明感。",
	"和在白铁摊贩街见面时相比，她的气质变得格外稳重，态度也显得淡然。不过，那应该不是她平时的本色才对。每当她内心感到动摇或迷惘，色泽如海洋一般的眼睛就会明显闪烁。",
	"俗话说旅行在外不用怕羞，表示少女先前表露的那一面，对她来说大概属于类似的心理吧。那属于她在日常生活中羞于对人表露的本色。",
	"「我叫……珂朵莉。」",
	"「嗯？」",
	"「这是我的名字。之前才叫你忘了我，事到如今还要介绍自己的名字，总觉得好难启齿......」",
	"「我叫威廉。请多指教，珂朵莉。」",
	"",
	"珂朵莉「唔」地哽住呼吸。",
	"「然后，呃，还有就是……」",
	"她摸索着如何开口。",
	"「……没事。长途旅行一定很累吧，好好休息。」",
	"「嗯。那么明天见。」",
	""
	};
	for (int i = 0; i <= 20; i++) {
		cout << s3[i] << endl;
		Sleep(t);
	}
	
	Sleep(2000);
	cout << "（第二卷完）" << endl;
	cout << "==========================================================================================================" << endl;
	choose();
}

void plot3() {
	int t = setspeed();
	string s0[30] = {
	"「调查队的顾问在吗？」",
	"威廉抵达装备保管库了。他推开半气密式的门，找寻貌似对方的人物。",
	"身上杂七杂八地穿着地表探索用装备的葛力克就在那里。",
	"",
	"「……喂？」",
	"「…………啊？」",
	"「下一个问题，这些是啥？」",
	"「防尘斗篷和围巾，还有风镜。」",
	"「干嘛交给我？」",
	"「今天风沙强啊，没准备就外出会有点危险。」",
	"「干嘛提到外出的事情？」",
	"「因为我们只有今天才能趁机潜入地下。」",
	"「难得有机会，我想让你看一块宝藏。那个没办法带回地上，所以得亲自下去现场就是了。」",
	"那算什么道理？",
	"「──啊，那边的小姑娘来得正好。你要不要一块去？」",
	"葛力克抬起脸，朝你背后唤了一声。",
	"",
	"威廉转头发现珂朵莉疑似偷偷摸摸想不被发现地离去的背影。",
	"珂朵莉缓缓回头，露出「这下怎么办」的表情。",
	"他想起昨晚的事情，脸色同样变得暧昧，视线游移不定。",
	"葛力克没注意到你们俩那副模样。",
	"「要潜入地下，三个人左右刚刚好。毕竟死角会减少，一个人摆乌龙有两个人能补救。还可以摆在地上当后勤人员。」",
	"他心情大好地多拿了一套防尘斗篷、围巾和风镜出来。",
	""
	};
	for (int i = 0; i <= 23; i++) {
		cout << s0[i] << endl;
		Sleep(t);
	}
	cout << "此时，如果是你准备怎么做：" << endl;
	cout << "1.借口肚子疼跑掉  2.穿好装备装备出发" << endl;
	int x;
	bool judge = 1;
	input: x = num();
	switch (x)
	{
	case 2:judge = 0; break;
	case 1:cout << "葛力克假装没听见并强行把装备塞给了你" << endl; break;
	default:
		break;
	}
	if (judge) {
		cout << "请重新选择：" << endl;
		goto input;
	}
	cout << endl << endl << endl;
	Sleep(2000);

	string s1[25] = {
	"在地下寒冷的空气中，有阵白茫的叹息浮现，然后消失。",
	"「──哎呀，你们等会儿。这条路断掉了。」",
	"在灯晶石照亮的小小视野内，葛力克的后脑勺止步了。",
	"眯眼瞪向路的前头。原来如此，可以看见尺寸各异的大块瓦砾堆成了稍有规模的路障。就算要清除后再前进，随便施加外力似乎会让头上的结构跟着垮下来。",
	"",
	"「伤脑筋。来到这里还要再折回去吗？」",
	"「一路过来有满多小路吧，不能绕道吗？」",
	"「路线太复杂，要一条一条调查也要花时间。再说这附近有〈第六兽〉的巢。我不想到处乱走刺激到它们。」",
	"「是那样吗──」威廉稍微思索又说：「──你说附近有什么巢？」",
	"「〈深潜的第六兽〉的巢。」",
	"葛力克淡然回答。",
	"「它们会几十只聚在一起，在地层中筑巢。基本上待在巢里的期间都跟植物一样睡死了不会动，但要是掉以轻心在它们身边徘徊，在罕见的情况下就会醒过来发动攻击。」",
	"第六兽。唯一会飘上天空来到悬浮大陆群的〈兽〉。妖精兵会被当成消耗性兵器的根本理由。",
	"",
	"「……呃。我可以插句话吗？」",
	"「虽然理由不好解释……但我们可不可以走这边的路进去看看？」",
	"什么都不做就掉头也嫌扫兴，一行人就决定走看看了。",
	"走在一路曲折的通路上。每次出现岔路，珂朵莉就会停下脚步，并做出竖耳倾听着什么的举动，然后毫不犹豫地选出一条路。",
	"",
	"「我总觉得有东西在呼唤我。」",
	"这是她本人的陈述。对于打算深入天然迷宫的人来说，这块罗盘有点靠不住。但现在既然没有其他明确的引路依据，也没有理由把她拦住。",
	"一行人不知道就这样走了多久。",
	"视野忽然变得开阔，你们来到一处房间。"
	};
	for (int i = 0; i <= 22; i++) {
		cout << s1[i] << endl;
		Sleep(t);
	}
	cout << endl << endl << endl;
	Sleep(2000);

	string s2[20] = {
	"「……真的假的。」",
	"葛力克发出惊叹。",
	"「我们到了。我想让你看的就是这东西。」",
	"葛力克用指背轻敲他所说的冰块。",
	"冰块里有东西。",
	"",
	"威廉举起灯晶石。",
	"透明度高得不自然的冰块里，可以看见鲜艳的绯红色彩。",
	"他倒抽一口气。",
	"「……这……这东西……」",
	"「吓到了吧？我也吓到了。没想到在这短短的人生中，可以看见两次这样的宝物。」",
	"是个年幼的──连与妖精仓库的小不点们相比，都还要更小的孩童。",
	"",
	"绯红的长发彷佛轻轻荡漾地停在那个动作。",
	"尽管表情看不清楚，看上去却似乎安详而平静。",
	"而且，在她的胸口，开着一道大大的刀伤。",
	"看起来像是活着。看起来也像安详地睡着了而已。然而，那肯定是具亡骸。",
	""
	};
	for (int i = 0; i <= 17; i++) {
		cout << s2[i] << endl;
		Sleep(t);
	}
	cout << "此时，如果是你会怎么做：" << endl;
	cout << "1.小声催葛力克赶紧回去  2.假装镇定但是再也不敢看第二眼  3.十分吃惊并继续观察" << endl;
	judge = 1;
	input1: x = num();
	switch (x)
	{
	case 3:judge = 0; cout << "有什么好怕的呢？" << endl; break;
	case 1:cout << "葛力克表示不认识这么胆小的人并决定不理你" << endl; break;
	case 2:cout << "葛力克感到奇怪并问你为什么不看了" << endl; break;
	default:
		break;
	}
	if (judge) {
		cout << "请重新选择：" << endl;
		goto input1;
	}
	cout << endl << endl << endl;
	Sleep(2000);

	string s3[25] = {
	"威廉催发一丁点魔力，让眼睛蕴含观察咒力的力量。",
	"「那道伤口被施加了某种诅咒。」",
	"「真的吗？」",
	"「真的。话虽如此，解开那道诅咒似乎也无法让她复生就是了。」",
	"「哎，先不谈该怎么办，先得把她从冰块弄出来才行。这种类型的诅咒会半永久性地固定住受诅者的状态。即使把她从冰块弄出来，应该也不会腐坏或者被虫吃掉──」",
	"突然，威廉感觉到背脊闪过一阵战慄。",
	"",
	"「──咦？」",
	"间隔片刻，不明理由的恐惧感从胃里涌了上来。受恐惧驱使的他找寻原因。他转过头，立刻就发现了。",
	"珂朵莉正一脸愕然地凝望着冰块中的少女。她全身充满了沉静而凶暴的魔力。",
	"「你……」",
	"只见她的发色逐渐改变。",
	"由蓝到红。珂朵莉逐渐消逝。",
	"",
	"「你这傻瓜！你在做什么！」",
	"威廉抓着她的肩膀猛晃。还甩了好几次耳光。可是，燃起的魔力没有缓歇。珂朵莉的目光没有聚焦，也不确定有没有意识。现在不赶快采取行动就太迟了。",
	"如此警觉的他将手掌比成尖锥，然后重重地戳入珂朵莉的心窝旁边。",
	"少女的表情瞬间痛苦扭曲。血液循环遭到打乱，肺脏受到挤压，燃起的魔力硬是被驱散，模糊的意识也被强行截断。",
	"「抱歉，之后再说！我们立刻回上面！」",
	"「哦……好。」",
	"葛力克困惑归困惑，应该还是察觉到情况有异。他坦然地点头以后，立刻就帮忙带路往回走。"
	};
	for (int i = 0; i <= 20; i++) {
		cout << s3[i] << endl;
		Sleep(t);
	}

	Sleep(2000);
	cout << "（第三卷完）" << endl;
	cout << "==========================================================================================================" << endl;
	choose();
}

void plot4() {
	int t = setspeed();
	string s0[25] = {
	"此时，时钟的指针指着十八点二十六分。",
	"第一个牺牲者是个当时很倒楣地被推去打扫窗户的猫徵族青年。为了想办法清掉窗框沾上的大量沙尘，他正一手拿着老旧拖把在奋战。",
	"连惨叫的时间都没有。",
	"",
	"此时，时钟的指针指着十八点二十八分。",
	"心情微醺地走在通路上的爬虫族三等武官，从窗户听见铿铿铿的响亮声音。纳闷是怎么回事的他凑近一瞧，就看见有某种深绿色的东西黏在窗外。而且，那绿色玩意儿似乎想用蛮力将窗户打破──不，它想将船体的墙壁整个打破。",
	"三等武官尖叫。",
	"窗户，冒出了，大条裂痕。",
	"此时，时钟的指针指着十八点三十二分。",
	"",
	"咒燃炉发出轰然声响，开始运作。",
	"就算早一秒也好，得尽快离开地表。要不然，他们这些人应该会通通被灰沙吞没，然后消失不见。",
	"「那……那那那……那是什么！」",
	"在一等技官混乱的尖叫声牵引下，葛力克将目光转向窗外。薄薄风沙的另一端，有无数轮廓近似树木的形影，正一边伸展其枝干，一边想将「车前草」的船体缠住。",
	"「那还用问，八成是大群的〈第六兽〉。」",
	"葛力克将子弹一颗颗地装进大型火药枪，并且嘟哝似的答话。",
	"这种东西当然不可能杀得了〈十七兽〉，但如果运用得当，或许还可以让它们退缩。至少总比手无寸铁要好些。",
	"那些家伙不知道是眼睛尖或鼻子灵，但它们就是能确实找出活着的人并展开袭击。无论屏住呼吸、装死还是躲到门后的死角都一样。只要人还活着在那里，就逃不过它们的獠牙或爪子。",
	"",
	"船体猛烈震动。斜倾。螺旋桨宛如自暴自弃地狂转。",
	"船从陆地上浮起。",
	"葛力克抓起传声器，开始大声地朝船内所有广播器下达指示。当然，做这些一样不是他的专业，但在目前这样的状况，要活下去就只有靠能做些什么的人来打拚一途。"
	};
	for (int i = 0; i <= 21; i++) {
		cout << s0[i] << endl;
		Sleep(t);
	}
	cout << endl << endl << endl;
	cout << "如果此时你在场会做什么：" << endl;
	cout << "1.找个安静的地方躲起来  2.惊慌失措忍不住哭出声  3.寻找可以利用的武器守护驾驶舱的安全" << endl;
	int x;
	bool judge = 1;
	input: x = num();
	switch (x)
	{
	case 3:judge = 0; cout << "你是个勇敢的人" << endl; break;
	case 1:cout << "躲起来也没用，因为哪里都不安全" << endl; break;
	case 2:cout << "周围的人虽然觉得你很没出息但也没空理你" << endl; break;
	default:
		break;
	}
	if (judge) {
		cout << "请重新选择：" << endl;
		goto input;
	}
	cout << endl << endl << endl;
	Sleep(2000);

	string s1[30] = {
	"时钟的指针指着十八点三十四分。",
	"珂朵莉没有恢复意识。",
	"从在地下昏倒以后，她的眼睛就没有张开。",
	"",
	"在那之后威廉立刻赶回飞空艇，冲进了医务室并一把抓住聘来的医生，逼对方不管怎样能将珂朵莉弄醒就好。",
	"结果当然是不行。",
	"珂朵莉本来就没有得什么病，更没有显着的外伤。对于看不出有何异常的人，根本没有能用的治疗手段。",
	"在持续沉睡的珂朵莉旁边，他仍坐在地板上，捧着头苦思。",
	"",
	"「……我在搞什么。」",
	"威廉低喃。",
	"明明想让珂朵莉幸福。",
	"明明自觉有那样的想法。",
	"从珂朵莉发生侵蚀以后，自己主动为她做了多少？",
	"自己领着珂朵莉朝她想要的未来前进了多少？",
	"他一项也想不到。",
	"他缓缓地站起。",
	"轻轻地将自己的唇，重叠在持续沉睡的珂朵莉唇上。",
	"滴答。从眼中盈出的泪珠，有一颗掉在少女的脸颊上。",
	"嘴唇离开。",
	"",
	"金属断裂的刺耳声响传来。离这里不远的地方，似乎有入侵者进了艇内。",
	"虽然入侵者不懂得看气氛，但他也觉得有些感激。与其在这里继续思考没营养的事，这样度过时间还像样一点。",
	"「抱歉。我去去就回来。」",
	"威廉背对着珂朵莉留下这句，然后离开房间。",
	"时钟的指针指着十八点三十五分。",
	"战况当然是绝望的。"
	};
	for (int i = 0; i <= 26; i++) {
		cout << s1[i] << endl;
		Sleep(t);
	}
	cout << endl;
	cout << "你觉得珂朵莉最终会怎么样？" << endl;
	cout << "1.醒来然后平安回去与威廉结婚  2.醒来然后参与战斗  3.被兽袭击身亡" << endl;
	input1: x = num();
	switch (x)
	{
	case 3:cout << "太惨了，威廉不会让这种事情发生的" << endl; break;
	case 1:cout << "这真是一个美好的结局" << endl; break;
	case 2:cout << "她是一个努力又勇敢的女孩" << endl; break;
	default:
		cout << "请输入1或2或3:" << endl;
		goto input1;
		break;
	}
	cout << endl << endl << endl;
	Sleep(2000);
	string s2[25] = {
	"灰色物体突然从旁边扑来，并且拦腰扫过。威廉将姿势放得更低，等对方掠过头顶。",
	"整条通路都被劈断了──不对，被敲断了。简直令人发噱的压倒性质量及速度。鬼扯般的破坏力。弹簧、螺丝钉、铜板及钢板，大小不同的金属零件飞舞在半空。",
	"那东西滑溜地从墙壁的缝隙冒出踪影。灰色的甲壳类。样似坚固的甲壳与节足，和螃蟹有点相像。当然，真正的螃蟹才不会超过十只腿，脚本身更不可能伸缩自如。",
	"",
	"强风飕飕地从被摧毁的墙壁外面吹了进来。",
	"〈兽〉将三条腿各往不同方向伸出。那些腿一边将天花板、墙壁和地板搅烂，一边逼近想将威廉打成肉泥。",
	"他缓缓放松架势，用舞蹈般的步伐和〈兽〉拉近距离。西高曼德曲刀术传下的初阶步法。据说练到炉火纯青就能让身体化为蜃景，使一切融入空中的绝技，但缺乏才华的威廉只能用来当简单的障眼法。",
	"而且，那就够了。〈兽〉的行动正如其名，只像只猛兽。只是力量过人，既无技巧也无术理。光是使出稍微混淆虚实的身法就能轻易钻过所有攻击。",
	"",
	"威廉贴近〈兽〉身边，来到能迎面感受气息的距离。近距离所见的〈兽〉，在身体表面状似有种奇妙的黏糊感。",
	"他挥出左拳。拳在半空捣中从天花板裂开砸下的一块铁板，直接让铁板砸在〈兽〉腿根部。当然没造成伤害。传闻连用枪炮集火也杀不了的对手，总不可能死在这种鳖脚拳法手下。",
	"他放低腰杆。扭过脚踝。转动肩膀。将所有吸入的空气蓄于丹田。",
	"一连串的动作接在一起，产生莫大的劲道，传达到拳头。",
	"完全紧贴下的打击。",
	"",
	"〈兽〉被震退的后方墙上有大块裂痕。那是刚才它伸腿造成的。而且，一旦被甩到半空中，这只没翅膀的〈兽〉就毫无手段回战场。",
	"在朱红色的天空中，〈兽〉不出声也不吼叫，静静地被灰色的大地吸纳而去。威廉目送它坠落的模样，然后才解除全身的架势。",
	"「……唔。」",
	"这副半残的身体逞强过头了。全身疼痛。",
	"威廉早就超出极限了。奋战至今只靠气力。最后承受到〈兽〉的一击，还有暂且守住这个船舱的安心感，将那丝气力也斩断了。",
	"身体热得像在燃烧。同时，也像冰一样冷透。",
	"脑袋变得一片空白。接着在下个瞬间，他已经倒进呼啸翻腾的狂风当中。"
	};
	for (int i = 0; i <= 21; i++) {
		cout << s2[i] << endl;
		Sleep(t);
	}

	Sleep(2000);
	cout << "（第四卷完）" << endl;
	cout << "==========================================================================================================" << endl;
	choose();
}

void plot5() {
	int t = setspeed();
	string s0 = "（下面的开始部分是珂朵莉的梦境，这里保存着她最后仅存的记忆。由于消耗魔力过度记忆发生侵蚀，她蓝色的头发几乎已经变为全红，如果再次挥发魔力参加战斗的话人格就会消失）";
	for (int i = 0; i < s0.size(); i++) {
		cout << s0[i];
		Sleep(60);
	}
	cout << endl << endl;
	Sleep(2000);

	string s1[20] = {
	"少女回神时，人站在昏暗的废墟当中。",
	"而且，有个似曾相识的小孩，带着快哭的表情站在她眼前。",
	"──怎么了，艾陆可？",
	"少女的记忆模糊归模糊，还是勉强想起了那个名字。",
	"",
	"你梦见悲伤的事了吗？",
	"艾陆可的身体打了哆嗦。",
	"『……珂朵莉……』",
	"艾陆可看向少女，低声叫了某个人的名字。那是谁的名字？少女觉得耳熟，她想了想。",
	"啊，对了。那是「我」的名字。少女抱着与某个怀念的人重逢似的心情，接纳了那个名字。重新听一遍，会觉得那是个怪名字。难记又难讲，更重要的是不太可爱。",
	"",
	"『对不起。』",
	"为什么要道歉呢？",
	"『我知道会变成这样。会发生许多难过的事情。』",
	"啊，还以为是什么呢。那不要紧喔。",
	"我反而要道谢才行。多亏你──多亏你闭上眼睛的关系，我才能遵守约定。我回到了想回去的地方。",
	"虽然我不想失去的东西──好像失去了不少。",
	"『……珂朵莉。』",
	""
	};
	for (int i = 0; i <= 18; i++) {
		cout << s1[i] << endl;
		Sleep(t);
	}
	cout << endl;
	cout << "如果你是珂朵莉，你会选择保留自己仅存的美好的记忆，还是醒来去救威廉？" << endl;
	cout << "1.我不想忘记最心爱的人  2.为了心爱的人我可以失去自己" << endl;
	int x;
	input: x = num();
	switch (x)
	{
	case 1:cout << "也挺好？" << endl; break;
	case 2:cout << "呜呜呜不要这么感人行不行啊" << endl; break;
	default:
		cout << "请输入1或2：" << endl;
		goto input;
		break;
	}
	Sleep(2000);
	cout << endl << endl << endl;

	string s2[15] = {
	"我有件事要拜托你。",
	"这肯定是我最后的心愿。",
	"『可是……』",
	"我没办法清楚想起来，但是，我应该有个想帮助的人。",
	"而且，我还有想传达给他的想法。所以──",
	"『无论如何？』",
	"无论如何。",
	"",
	"『珂朵莉，这次你真的会消失喔？』",
	"反正，我现在几乎也等于消失了。",
	"何况──我终于明白了。「我」本来就是那样的存在吧？",
	"『…………』",
	"我全都明白。就是明白，才会拜托你。",
	"求求你──让我回去那里，再一次就好。",
	"",
	};
	for (int i = 0; i <= 14; i++) {
		cout << s2[i] << endl;
		Sleep(t);
	}
	cout << endl << endl;
	Sleep(2000);
	string s3[30] = {
	"──她起来了。",
	"有着长长红发的少女从床上起身。",
	"「呃……」",
	"这里是什么地方，我是什么人？",
	"脑海里像蒙上了迷雾，不对，像被涂上了泥巴，她什么也想不起来。",
	"「隆」的一声，世界摇晃了。从某个遥远的地方，还传来金属相互碰撞般的剧烈声响。这里是战场或什么来着吗？少女茫然地思考。",
	"她找到门，徬徨地出了房间。来到狭窄的通路。",
	"",
	"少女漫无目的地在四周游荡。不久，她来到视野格外开阔的地方。墙壁几乎都被扒开了，在外面，可以看见开始染上夕色的整片蓝天。",
	"蓝色经过淡紫，逐渐被红色掩盖。",
	"「珂朵莉……？」",
	"少女听见惊呼似的声音，转了头。",
	"在脏兮兮的通路上，有个少女豪迈地张开双手双脚倒在地上。她燃起的魔力似乎相当猛烈，即使如此，全身所负的伤势仍让她无法动弹。",
	"「你白痴啊，这里很危险……既然你醒了，就赶快找地方躲起来。」",
	"大概是熟人吧，红发少女心想。",
	"",
	"对方似乎认识她。可是，她却完全想不起对方是谁。心里所缺的那一角，早就消失不见了。",
	"有更重要的事。在墙上所开的大洞外面，整片蓝与红的天空中。",
	"看得见有个彷佛随时要消失的人影。",
	"「啊。」",
	"她想起来了。是他。虽然连名字都想不起来，不过那应该是非常重要的人。",
	"不知怎的，她觉得那似乎是个会把不必要的苦头都揽在自己身上的人。呃，可是就算那样，为什么他会在那种地方当自由落体呢？他应该不属于背后长有翅膀的生物，",
	"就那样摔到地上不是会死吗？",
	""
	};
	for (int i = 0; i <= 23; i++) {
		cout << s3[i] << endl;
		Sleep(t);
	}
	cout << endl;
	cout << "你觉得威廉最后会怎么样：" << endl;
	cout << "1.掉到地上摔死  2.被珂朵莉救下  3.奇迹般的没有摔死" << endl;
	input1: x = num();
	switch (x)
	{
	case 1:cout << "太惨了，珂朵莉一定会救他的" << endl; break;
	case 2:cout << "事实也确实是这样" << endl; break;
	case 3:cout << "有可能，毕竟他很强" << endl; break;
	default:
		cout << "请输入1或2或3：" << endl;
		goto input1;
		break;
	}
	cout << endl << endl << endl;
	Sleep(2000);

	string s4[20] = {
	"「唉，真没办法。」",
	"她吆喝一声，跨过墙壁残骸，打算跟着跳下去──在那之前。有把合用的剑正好掉在旁边，她便捡起来。剑柄上所刻的名称为「狄斯佩拉提欧」。原来如此，「断绝的希望狄斯佩拉提欧」，",
	"玄虚味十足的名字。",
	"「住手，你别去。」",
	"仍倒在地上的少女呻吟似的说。",
	"「别再作战了。别牺牲。你该贡献的战力，有我们补上。所以，你──」",
	"她大概是伤到了肺脏，话说到这里便猛咳。",
	"「──既然你不用战斗了，就别上场战斗。既然你可以得到幸福，就要让自己幸福。否则，我们几个，没办法接受。」",
	"应该是过度催发魔力，使她意识模糊了。她将有些游移不定的目光转向这里，拚命地朝红发少女诉说。",
	"",
	"「对不起。我已经绝对无法获得幸福了。」",
	"红发少女朝狄斯佩拉提欧灌注微薄的魔力。彷佛原本就属于她身体的一部分，力量一下子就融入剑身。",
	"「因为我发现，我早就已经被幸福所包围了。」",
	"她露齿一笑──",
	"然后，少女便投身于无处立足的天空当中。"
	};
	for (int i = 0; i <= 14; i++) {
		cout << s4[i] << endl;
		Sleep(t);
	}
	cout << endl;
	Sleep(2000);
	string s5[35] = {
			"",
			"头发令人烦躁地随风翻飞。",
			"用不着特地催发，全身的魔力已经满得不能再满。",
			"『着火掉下来的许多书本』『游于火中之蛇』『缺角塌陷的银月』",
			"硄啷。硄啷。心灵的碎片随幻听逐步瓦解。",
			"又一片。又一片。",
			"『横渡群星之船』『成排棺材』『破裂的天棚』",
			"硄啷。硄啷。硄啷。",
			"许多记忆逐渐脱离脑海。快乐的事，还有痛苦的事都一样。可以实际体会到自己的心越来越接近白纸。可是──",
			"",
			"『加油』",
			"她的嘴边，自然而然地浮现了笑容。",
			"宛如在梦中游泳。",
			"无可奈何的焦躁感纠缠着手脚。",
			"被无穷拖长的时间。逐步加速的意识。",
			"每次挥动右臂，就会丧失两项东西。",
			"有只〈兽〉被熊熊燃烧的魔力洪流吞没，然后蒸发。",
			"",
			"少女心中勉强还留存着的「珂朵莉」，随着硄啷硄啷的些微幻听，一点一点地消去。",
			"（──啊──）",
			"她应该有不想失去的回忆。",
			"那是什么回忆，她已经记不起了。",
			"她应该有不想放弃的未来。",
			"但对于未来本身，她已经无法想像。",
			"一切的一切都没了。",
			"手已被放开。",
			"",
			"她不后悔。她觉得并不后悔。大概，不太确定。能用来判断那些的记忆，已经不存在她心中。",
			"就那样过了多久呢？",
			"原本以为不会结束的战斗，却还是迎来结尾了。",
			"被斩断，被敲烂，被烧光的〈兽〉，数量共计七百一十五只。",
			"那就是全部了。",
			"少女发觉周围没有〈兽〉以后，才总算停下动作。",
			""
	};
	for (int i = 0; i <= 33; i++) {
		cout << s5[i] << endl;
		Sleep(t);
	}
	cout << endl;
	cout << "你觉得珂朵莉幸福吗：" << endl;
	cout << "1.失去了幸福的记忆太悲伤了  2.能够保护自己心爱的人好幸福" << endl;
	input2: x = num();
	switch (x)
	{
	case 1:cout << "确实......" << endl; break;
	case 2:cout << "听起来好难过" << endl; break;
	default:
		cout << "请输入1或2：" << endl;
		goto input2;
		break;
	}
	cout << endl << endl << endl;
	Sleep(2000);

	string s6[30] = {
	"风停了。",
	"燃烧似的红发返照着月光，微微散发出光芒。",
	"──有人倒在地上。",
	"那是谁呢？少女心想。",
	"她费力地转头，看向那边。",
	"夜色中，有个黑发青年昏倒在地上。",
	"",
	"「啊……」",
	"她抬起脸，想说些什么。可是，在先前战斗中反覆胡乱地换气的喉咙早就毁了，何况她也不晓得该说些什么。",
	"青年一副随时要哭出来的脸。不知怎的，那令她莫名地伤心。",
	"这个人是谁呢？",
	"对少女来说，肯定是个非常重要的人才对。",
	"她却想不起来。",
	"连失落感都没有。",
	"",
	"──真希望这个人能笑，少女心想。",
	"她希望他可以「咯咯咯」地露出坏心眼的笑容。",
	"然而，少女同时也希望他哭。",
	"但愿这个人对自己怀有的感情，会让他为了变成空壳的她哭泣。她好狠心。真的，好狠心。",
	"",
	"青年的眼睛微微睁开，他似乎看了她这边。少女打从心底欣喜。现在还能告诉他。在这颗已经丧失一切的心里，连自己是谁都已经迷失，却依然残留着的最后心愿。",
	"无论如何，她都希望在完全丧失自己以前，能先告诉他的一句话。",
	"谢谢你。",
	"少女设法用唇形如此表达。",
	"最后，她倾注全心全意，露出笑容。",
	"于是，少女的意识，这次真的完全消灭了。"
	};
	for (int i = 0; i <= 25; i++) {
		cout << s6[i] << endl;
		Sleep(t);
	}
	cout << endl;
	Sleep(3000);
	cout << "(完)" << endl;
	cout << "==========================================================================================================" << endl;
	Sleep(2000);
	choose();
}

void about() {
	cout << endl << endl << endl;
	string s[10] = {
		"写这个无聊的文字游戏的最初目的只是为了完成一次C++大作业，",
		"由于时间紧迫和本人水平问题，原小说剧情被我改的面目全非，",
		"而且游戏也基本没有什么可玩性，",
		"希望有兴趣的大佬可以随意拿代码去改（改好后最好让我也体验一下）。",
		"有需要的也可以拿去交作业。",
		"作者：鸭酱",
		"QQ群：962547290"
	};
	for (int i = 0; i <= 6; i++) {
		for (int j = 0; j < s[i].size(); j++) {
			cout << s[i][j];
			Sleep(60);
		}
		cout << endl;
		Sleep(500);
	}
	cout << endl << endl << endl;
	choose();
}